type-one/PublishSubscribeESP32/sdkconfig.defaults.esp32c5
CONFIG_IDF_TARGET="esp32c5"

# Enable PSRAM / SPIRAM (8MB Octal PSRAM or more)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
